cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF32xS.svd
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended pin function setting register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK11B" -->
            <field>
              <name>SCK11B</name>
              <description>SCK11 input/output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT11B" -->
            <field>
              <name>SOT11B</name>
              <description>SOT11B input/output select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN11S" -->
            <field>
              <name>SIN11S</name>
              <description>SIN11S input select bit</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK10B" -->
            <field>
              <name>SCK10B</name>
              <description>SCK10 input/output select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT10B" -->
            <field>
              <name>SOT10B</name>
              <description>SOT10B input/output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN10S" -->
            <field>
              <name>SIN10S</name>
              <description>SIN10S input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK9B" -->
            <field>
              <name>SCK9B</name>
              <description>SCK9 input/output select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT9B" -->
            <field>
              <name>SOT9B</name>
              <description>SCK9B input/output select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN9S" -->
            <field>
              <name>SIN9S</name>
              <description>SIN9S input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK8B" -->
            <field>
              <name>SCK8B</name>
              <description>SCK8 input/output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT8B" -->
            <field>
              <name>SOT8B</name>
              <description>SOT8B input/output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN8S" -->
            <field>
              <name>SIN8S</name>
              <description>SIN8S input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description>Extended pin function setting register 17</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK15B" -->
            <field>
              <name>SCK15B</name>
              <description>SCK7 input/output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT15B" -->
            <field>
              <name>SOT15B</name>
              <description>SOT7B input/output select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN15S" -->
            <field>
              <name>SIN15S</name>
              <description>SIN7S input select bit</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK14B" -->
            <field>
              <name>SCK14B</name>
              <description>SCK6 input/output select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT14B" -->
            <field>
              <name>SOT14B</name>
              <description>SOT6B input/output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN14S" -->
            <field>
              <name>SIN14S</name>
              <description>SIN6S input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK13B" -->
            <field>
              <name>SCK13B</name>
              <description>SCK5 input/output select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT13B" -->
            <field>
              <name>SOT13B</name>
              <description>SOT5B input/output select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN13S" -->
            <field>
              <name>SIN13S</name>
              <description>SIN5S input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK12B" -->
            <field>
              <name>SCK12B</name>
              <description>SCK4 input/output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT12B" -->
            <field>
              <name>SOT12B</name>
              <description>SOT4B input/output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN12S" -->
            <field>
              <name>SIN12S</name>
              <description>SIN4S input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
